---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.LuminousIntensity
source: html/7b714a16-1f9d-a778-c145-1cf0c39d49c3.htm
---
# Autodesk.Revit.DB.SpecTypeId.LuminousIntensity Property

Luminous Intensity, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId LuminousIntensity { get; }
```